tap "homebrew/cask-fonts"

# general stuff
brew "coreutils"
brew "fzf"
brew "jq" 
brew "neovim", args: ["HEAD"]
brew "tmux", args: ["HEAD"]
brew "gpg"
brew "git"
brew "wget"
brew "yt-dlp"
brew "qemu"
brew "ffmpeg"
brew "ansible"
brew "nmap"

# cli replacements
brew "bat"     # cat, less
brew "exa"     # ls
brew "eva"     # bc
brew "dust"    # du
brew "fd"      # find
brew "htop"    # top
brew "ripgrep" # grep

# languages
brew "go"
brew "node"

# fonts
cask "font-iosevka-ss04"
cask "font-iosevka-ss07"
cask "font-iosevka-ss09"
cask "font-iosevka-ss14"

cask "qlvideo"
cask "firefox"
cask "alacritty"
cask "macfuse"
cask "discord"
cask "docker"
cask "visual-studio-code"
cask "iina"
cask "bitwarden"
cask "rectangle"
cask "eloston-chromium"
cask "via"
cask "figma"
cask "obs"
cask "tidal"
cask "utm"

